# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Iden, [3]],                                  #  0
   [-1, 1, GML_mask, [1] ],  # 0-P1/2  #                #  1
   [[-1, -2], 1, Hard, [3] ],  # 0-P1/2  #              #  2
   [[-2, -3], 1, Easy, [512, 2, 2, 5] ],  # 0-P1/2  #     #  3 4 -> 40 5 -> 20
   [-2, 1, Conv, [64, 6, 2, 2] ],                       #  4
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4               #  5
   [-1, 3, C3, [128]],                                 #  6
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8               #  7
   [-1, 6, C3, [256]], # 原p4                          #  8
   # [[-1, 3], 1, SKConv, [512, 512, 32, 2, 8, 2]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16              #  9

   [-1, 9, C3, [512]],                                 #  10
   # [[-1, 3], 1, SKConv, [512, 512, 32, 2, 8, 2]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32             #  11

   [-1, 3, C3, [1024]],                                #  12
   [[-1, 3], 1, SKConv, [512, 512, 32, 2, 8, 2]],# [[-1, 3], 1, Add, [1]],  #[[-1, 3], 1, SKConv, [512, 512, 32, 2, 8, 2]], # [[-1, 3], 1, Add, [1]],
   [-1, 1, SPPF, [1024, 5]],  # 9 12                  #  14
  ]

# YOLOv5 v6.0 head
head:
  [
    # [[-1, 3], 1, SKConv, [512, 512, 32, 2, 8, 2]],
    [-1, 1, Conv, [512, 1, 1]],                        #  15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],        #  16
   #   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
                            #  16
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4     #  17
   [-1, 3, C3, [512, False]],  # 13                   #  18
   [-1, 1, Conv, [256, 1, 1]],                        #  19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],        #  20
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [[-1, 8], 1, Concat, [1]],  # cat backbone P3      #  21
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small) 20   #  22
   [-1, 1, Conv, [256, 3, 2]],                        #  23
#   [[-1, 14], 1, Concat, [1]],  # cat head P4

   [[-1, 19], 1, Concat, [1]],  # cat head P4         #  24
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium) 23   # 25
   [-1, 1, Conv, [512, 3, 2]],                          # 26

#   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [[-1, 15], 1, Concat, [1]],  # cat head P5          # 27
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large) 26  # 28

#   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#   [[22, 25, 28], 1, Detect, [nc, anchors, False]],  # Detect(P3, P4, P5)  # 29 # 不开启解耦头
   [[22, 25, 28], 1, Detect, [nc, anchors, True]],  # Detect(P3, P4, P5)  # 29 #  开启解耦头
]
